<?php
//массив
$obl = [
	'Московская область:' => ['Москва', 'Зеленоград', 'Клин'],
	'Ленинградская область:' => ['Санкт-Петербург','Всеволожск','Павловск','Кронштадт'],
	'Рязанская область:' => ['Рязань','Касимов','Скопин','Шацк']
];



//Функция

function town($arr){
	
	foreach ($arr as $key => $value){
		
		echo $key . '<br>';
		$dl=count($arr[$key]); // длина массива
		
		 for ($i = 0; $i < $dl; $i++) {
           
            if ($i == $dl - 1) {
                echo $arr[$key][$i] . '.' . '<br>'; //Ставим точку и переносим 
            } else {
                echo $arr[$key][$i] . ', ';  // Ставим запятую
			}
		 }
	}	
}




?>