<?php

//массив
$obl = [
	'Московская область:' => ['Москва', 'Зеленоград', 'Клин'],
	'Ленинградская область:' => ['Санкт-Петербург','Всеволожск','Павловск','Кронштадт'],
	'Рязанская область:' => ['Рязань','Касимов','Скопин','Шацк']
];

$lit = "К"; //Задаем букву для поиска

town($obl, $lit);

//Функция

function town($arr, $lit){
	
	foreach ($arr as $key => $value){

		$notTown = 0;
						
		$dl=count($arr[$key]); // длина массива
		
		 for ($i = 0; $i < $dl; $i++) {
			 //кириллица
           $tLit = preg_split('//u', $arr[$key][$i], 0, PREG_SPLIT_NO_EMPTY);
		   
            if ($tLit[0] == $lit) {
				echo implode($tLit) . '<br>';
				} else {
				$notTown++;
                // если счетчик неподходящих городов == количество городов в массиве, то выводим сообщение
                if ($notTown == $tLit) {
					return print "Города на букву '{$lit}' в массиве отсутствуют.";
                }
				
			}
		}	
	}
}

?>
